
&НаКлиенте
Процедура ПриИзмененииНоменклатурыНоменклатурнойГруппы (ИзмененнаяСтрока)
	//	Создать клиентскую процедуру ПриИзмененииНоменклатурыНоменклатурнойГруппы 
	//с параметром ИзмененнаяСтрока (ДанныеФормыЭлементКоллекции), 
	//в которой, если НоменклатураНоменклатурнаяГруппа заполнена, 
	//вызвать ЦеныВызовСервера.СкидкаНаДату и заполнить скидку.
	
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа) Тогда
		ИзмененнаяСтрока.Скидка = ЦеныВызовСервера.СкидкаНаДату(ИзмененнаяСтрока.НоменклатураНоменклатурнаяГруппа, Объект.Дата);
	КонецЕсли;  
		
КонецПроцедуры


&НаКлиенте
Процедура СкидкиНоменклатураНоменклатурнаяГруппаПриИзменении(Элемент)
	//Переопределить событие ПриИзменении поля ввода номенклатуры / номенклатурной группы 
	//и вызвать в нем процедуру ПриИзмененииНоменклатурыНоменклатурнойГруппы 
	//с передачей текущих данных таблицы скидок.     
	
	ТекДанные = Элементы.Скидки.ТекущиеДанные;
	ПриИзмененииНоменклатурыНоменклатурнойГруппы (ТекДанные);
	
КонецПроцедуры

