
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
	//заполним реквизит формы «Тип» значением по умолчанию «ЮридическоеЛицо», 
	//а реквизит формы «Ответственный» — значением параметра сеанса «ТекущийСотрудник»
	ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо; 
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//определяем юр и  физ лицо это:
	ЭтоЮрЛицо  = ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо");
	ЭтоФизЛицо = ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо");
	
	//определяем длину полей КПП
	ДлинаКПП = СтрДлина(КПП);  
	
	Если ЭтоЮрЛицо И ДлинаКПП <> 9 Тогда  
		Сообщить ("Длина КПП юридического лица должна составлять 9 символов");
		Отказ = Истина; //отказать от записи объектра в БД
		
	КонецЕсли;
	
КонецПроцедуры   




