
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	//только если вид формы - форма объекта мы отключаем стандарнтую обработку и выбираем нужную форму 
	//в зависимости от права администрирования
	//Иначе при открытии справочника Сотрудники сразу открывается формы элементов
	Если ВидФормы = "ФормаОбъекта" Тогда  
		СтандартнаяОбработка = Ложь;  
		
		Если ПравоДоступа("Администрирование", Метаданные) Тогда
			ВыбраннаяФорма = Метаданные.Справочники.Сотрудники.Формы.ФормаАдминистратора; 
			
		Иначе 
			ВыбраннаяФорма = Метаданные.Справочники.Сотрудники.Формы.ФормаПользователя; 
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры
