
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)  
	
	//искать по наименованию пользователя некорректно, т.к. может поменяться имя или логин, лучше по УИН
	//Значение УИН получиим, обратившись к функции «ТекущийПользователь()» менеджера «ПользователиИнформационнойБазы»
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь(); 
	//найдем сотрудника по УИН
	ПараметрыСеанса.ТекущийСотрудник = Справочники.Сотрудники.НайтиПоРеквизиту("ИдентификаторПользователяИнформационнойБазы", 
										ТекущийПользователь.УникальныйИдентификатор);
	
	
КонецПроцедуры
