
&НаСервере   
//проанализировать параметры с которыми открыта форма можно ПриСозданииНаСервере

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//можем обращаться к структуре параметра 
	//если установлен отбор, то меняется заголовок формы
	
	//проверяем есть ли отбор в принципе
	//"Свойство" получает значение элемента по указанному имени и проверяет есть ли указанное свойство. Возвращает Истина или Ложь
	Если Параметры.Свойство("Отбор") Тогда
		//проверить какое значение отбора установлено
		Если Параметры.Отбор.Свойство("Уволен") Тогда 
			//если не сделать автозаголовок, то форма отбора будет называться пр. "Уволенные сотрудники: Сотрудники" 
			
			ЭтотОбъект.АвтоЗаголовок = Ложь;
			
			// пропишем как будет менять форма при устаноленно отборе
			Если Параметры.Отбор.Уволен Тогда
				//установлен отбор по уволенным
				ЭтотОбъект.Заголовок = "Уволенные сотрудники";
			Иначе
				//установлен отбор по работающим
				ЭтотОбъект.Заголовок = "Работающие сотрудники";
			КонецЕсли;    
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
