
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//для использования отбора надо создать структуру и установить ее в параметры формы
	Отбор =  Новый Структура;
	Отбор.Вставить("Уволен", Истина);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Справочник.Сотрудники.ФормаСписка", 
				ПараметрыФормы, 
				ПараметрыВыполненияКоманды.Источник,
				//изменить уникальность, т.к. если одно и тоже значение, то если открыто одно окно, второе не откроется
				//В качестве ключа уникальности - уволен или нет
                "Уволен", 
				ПараметрыВыполненияКоманды.Окно, 
				ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
