
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	СуммаДокумента = ТоварыИУслуги.Итог("Сумма"); 
	//товары - название табл.части, итог - команда. "Сумма" - название колонки
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//формировать движения (выбрав предварительно запросом табличную часть с типами номенклатуры):  
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПоступлениеТоваровИУслугТоварыИУслуги.Номенклатура.ТипНоменклатуры КАК НоменклатураТипНоменклатуры,
			|	ПоступлениеТоваровИУслугТоварыИУслуги.Номенклатура КАК Номенклатура,
			|	ПоступлениеТоваровИУслугТоварыИУслуги.Количество КАК Количество,
			|	ПоступлениеТоваровИУслугТоварыИУслуги.Сумма КАК Сумма
			|ИЗ
			|	Документ.ПоступлениеТоваровИУслуг.ТоварыИУслуги КАК ПоступлениеТоваровИУслугТоварыИУслуги
			|ГДЕ
			|	ПоступлениеТоваровИУслугТоварыИУслуги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("Выберете товары или услуги");  
		Отказ = Истина;
	КонецЕсли;
	
	ТабличнаяЧасть = РезультатЗапроса.Выгрузить();
	
	
	//По регистру ВзаиморасчетыСКонтрагентами - 
	//одно движение вида "Расход" с указанием контрагента-поставщика и общей суммы  
	Движения.ВзаиморасчетыСКонтрагентами.Очистить();
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	
	Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Контрагент = Поставщик;
	Движение.Сумма = СуммаДокумента;
	
	//По регистру Товары - движения вида "Приход" по каждой строке с 
	//номенклатурой типа Товары с указанием номенклатуры, количества и суммы
	
	Движения.Товары.Очистить();
	Движения.Товары.Записывать = Истина;
	
	Движения.Расходы.Очистить();
	Движения.Расходы.Записывать = Истина;
	
	ТипТовар = Перечисления.ТипыНоменклатуры.Товар;
	
	Для каждого Строка из ТабличнаяЧасть Цикл
		
		Если Строка.Номенклатура.ТипНоменклатуры = ТипТовар Тогда
			
			Движение = Движения.Товары.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = Строка.Номенклатура;
			Движение.Количество = Строка.Количество;
			Движение.Сумма = Строка.Сумма;
			
		Иначе  
			//По регистру Расходы - движения по каждой строке с 
			//номенклатурой типа Услуги с указанием номенклатуры и суммы
			Движение = Движения.Расходы.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = Строка.Номенклатура;
			Движение.Сумма = Строка.Сумма;   
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


