
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры



Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Переопределить событие ОбработкаПроведения, формируя движения по регистру сведений Скидки датой документа
	Движения.Скидки.Записывать = Истина;
	
	Для каждого ТекСтрокаСкидки из Скидки Цикл
		
		Движение = Движения.Скидки.Добавить();
		Движение.Период = Дата;
		Движение.НоменклатураНоменклатурнаяГруппа = ТекСтрокаСкидки.НоменклатураНоменклатурнаяГруппа;
		Движение.Скидка = ТекСтрокаСкидки.Скидка;
		
	КонецЦикла;
	
КонецПроцедуры



