

  Функция ИННВерен (ИНН, ТипКонтрагента, ТекстОшибки) Экспорт
	  
	  //проверка длины ИНН
	  //пустой ИНН корректен
	  Если НЕ ЗначениеЗаполнено(ИНН) Тогда
		  Возврат Истина;
	  КонецЕсли;
	  
	  
	  //Если ИНН заполнен то проверем длину ИНН и сравниваем с корректной длиной
	  Если СтрДлина(ИНН) <> КорректнаяДлинаИНН(ТипКонтрагента) Тогда
		  ТекстОшибки = "Введен ИНН неверной длины";
		  Возврат Ложь;
	  КонецЕсли;
	  
	  //проверим запрещенные символы
	  Если ЕстьЗапрещенныеСимволы (ИНН) Тогда
		  ТекстОшибки = "Введен ИНН с неверными символами"; 
		  Возврат Ложь; 
	  КонецЕсли;
	  
	  //проверим правильность ИНН для юр.лиц
	  Если СтрДлина(ИНН) = 10 Тогда
		  
		  Если Не ПроверкаКонтрольногоРазряда10(ИНН) Тогда //вернет Истину или Ложь 
			  ТекстОшибки = "Введен несуществующий ИНН";
			  Возврат Ложь;
		  КонецЕсли;
		  
		  //проверим правильность ИНН для физ.лиц
	  Иначе
		  Если Не ПроверкаКонтрольногоРазряда12(ИНН) Тогда  //вернет Истину или Ложь
			  ТекстОшибки = "Введен несуществующий ИНН";
			  Возврат Ложь;
		  КонецЕсли;
		  
	  КонецЕсли;
	  
	  Возврат Истина;
	  
  КонецФункции
  
  
  Функция  КорректнаяДлинаИНН (ТипКонтрагента)
	  
	  Если ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") ТОгда
		  Возврат 10;  
	  Иначе
		  Возврат 12;  
	  КонецЕсли;
	  
  КонецФункции  
  
  Функция  ЕстьЗапрещенныеСимволы (ИНН)
	  
	  //проверка состава строки ИНН и КПП, чтобы там содержались только цифры
	  
	  //определим строку. состоящую только из цифр чтобы потом среди этого набора цифр искать символ из поля ИНН и КПП
	  РазрешенныеСимволы = "1234567890";
	  
	  //определим длину поля ИНН чтобы ограничить счетчик количеством символов
	  ДлинаИНН = СтрДлина(ИНН);
	  
	  //цикл со счетчиком для перебора символов для ИНН
	  Для Счетчик = 1 по ДлинаИНН Цикл
		  //получение очередного символа Сред()
		  СимволСтрокиИНН = Сред (ИНН, Счетчик, 1); 
		  
		  //определим есть ли каждый символ строки в числе разрешенных символов с помощью СтрНайти
		  //если найден запрещенный символ, функция вернет Истина и прервется цикл 
		  Если Не СтрНайти(РазрешенныеСимволы, СимволСтрокиИНН) Тогда
			  Возврат Истина;
			  Прервать; //прерываем цикл чтобы не проверять другие значения  
		  КонецЕсли;
		  
	  КонецЦикла;  
	  
	  Возврат Ложь; //нет запрещенных символов 
	  
  КонецФункции

  Функция ПроверкаКонтрольногоРазряда10(Знач ИНН)
	  
	  Перем КонтрольнаяСумма, КонтрольныйРазряд, Множители, ПроверкаКонтрольногоРазряда10ЗначногоИНН, Произведение, Сч, ЦифраИНН;
	  
	  //создадим массив с множителями
	  Множители = СтрРазделить("2,4,10,3,5,9,4,6,8,0", ",");
	  
	  //Вычисляется контрольная сумма со следующими весовыми коэффициентами разрядов 
	  //кода ИНН: (2,4,10,3,5,9,4,6,8,0)
	  КонтрольнаяСумма = 0;
	  
	  Для Сч = 1 по 10 Цикл 
		  ЦифраИНН = Число (Сред (ИНН, сч, 1));
		  Произведение = ЦифраИНН * Множители [сч-1];
		  КонтрольнаяСумма = КонтрольнаяСумма + Произведение;
	  КонецЦикла;  
	  
	  //Вычисляется контрольное число как остаток от деления контрольной суммы на 11
	  КонтрольныйРазряд = КонтрольнаяСумма % 11;
	  
	  //Если контрольное число больше 9, 
	  //то контрольное число вычисляется как остаток от деления контрольного числа на 10
	  Если КонтрольныйРазряд = 10 Тогда
		  КонтрольныйРазряд = 0;
	  КонецЕсли;
	  
	  //Контрольное число проверяется с десятым знаком ИНН. 
	  //В случае их равенства ИНН считается правильным
	  Если Сред (ИНН, 10, 1) <> Строка (КонтрольныйРазряд) Тогда  
		  ПроверкаКонтрольногоРазряда10ЗначногоИНН = Ложь; 
		  
	  Иначе
		  ПроверкаКонтрольногоРазряда10ЗначногоИНН = Истина;
		  
	  КонецЕсли;
	  
	  Возврат ПроверкаКонтрольногоРазряда10ЗначногоИНН;
	  
  КонецФункции 

  Функция ПроверкаКонтрольногоРазряда12(Знач ИНН)
	  
	  Перем КонтрольнаяСумма1, КонтрольныйРазряд1, КонтрольнаяСумма2, КонтрольныйРазряд2, Множители, ПроверкаКонтрольногоРазряда12ЗначногоИНН, Произведение, Сч, ЦифраИНН;
	  
	  //создадим массив с множителями
	  Множители = СтрРазделить("7,2,4,10,3,5,9,4,6,8,0", ",");
	  
	  //Вычисляется контрольная сумма по первым 11-ти знакам 
	  //со следующими весовыми коэффициентами: (7,2,4,10,3,5,9,4,6,8,0)
	  КонтрольнаяСумма1 = 0;
	  
	  Для Сч = 1 по 11 Цикл 
		  ЦифраИНН = Число (Сред (ИНН, сч, 1));
		  Произведение = ЦифраИНН * Множители [сч-1];
		  КонтрольнаяСумма1 = КонтрольнаяСумма1 + Произведение;
		  
	  КонецЦикла;
	  
	  //Вычисляется контрольное число_1 как остаток от деления контрольной суммы на 11
	  КонтрольныйРазряд1 = КонтрольнаяСумма1 % 11;
	  
	  //Если контрольное число_1 больше 9, 
	  //то контрольное число_1 вычисляется как остаток от деления контрольного числа_1 на 10
	  Если КонтрольныйРазряд1 = 10 Тогда
		  КонтрольныйРазряд1 = КонтрольныйРазряд1 %10;
	  КонецЕсли; 
	  
	  //Вычисляется контрольная сумма по 12-ти знакам со 
	  //следующими весовыми коэффициентами: (3,7,2,4,10,3,5,9,4,6,8,0)
	  //создадим массив с множителями
	  Множители = СтрРазделить("3,7,2,4,10,3,5,9,4,6,8,0", ",");
	  
	  КонтрольнаяСумма2 = 0;
	  
	  Для Сч = 1 по 12 Цикл 
		  ЦифраИНН = Число (Сред (ИНН, сч, 1));
		  Произведение = ЦифраИНН * Множители [сч-1];
		  КонтрольнаяСумма2 = КонтрольнаяСумма2 + Произведение;
		  
	  КонецЦикла; 
	  
	  //Вычисляется контрольное число_2 как остаток от деления контрольной суммы на 11
	  КонтрольныйРазряд2 = КонтрольнаяСумма2 % 11;
	  
	  //Если контрольное число_2 больше 9, то контрольное число_2 
	  //вычисляется как остаток от деления контрольного числа_2 на 10.
	  Если КонтрольныйРазряд2 = 10 Тогда
		  КонтрольныйРазряд2 = КонтрольныйРазряд2 %10;
	  КонецЕсли;
	  
	  //Контрольное число_1 проверяется с одиннадцатым знаком ИНН и 
	  //контрольное число_2 проверяется с двенадцатым знаком ИНН. 
	  //В случае их равенства ИНН считается правильным
	  Если Сред (ИНН, 11, 1) <> Строка (КонтрольныйРазряд1) Или Сред (ИНН, 12, 1) <> Строка (КонтрольныйРазряд2) Тогда 
		  ПроверкаКонтрольногоРазряда12ЗначногоИНН = Ложь; 
	  Иначе
		  ПроверкаКонтрольногоРазряда12ЗначногоИНН = Истина;
	  КонецЕсли;
	  
	  Возврат ПроверкаКонтрольногоРазряда12ЗначногоИНН;
	  
  КонецФункции 

  
    
  
  